{
  "Automatic Identication of CDSS Ontology Entity Candidates": {
    "image": "carousel_1.jpg",
    "short-description": "We are leveraging deep learning and natural language processing techniques to automatically identify key phrases for the CDSS ontology we are constructing.",
    "long-description": "Interoperability is a well-recognized barrier in the health information technology field. To facilitate the interoperability of clinical decision support systems’ (CDSS) rules, we propose using Semantic Web technologies to build an ontology for CDSS. To iteratively improve the identification of concepts from unseen corpora and produce results comparable to a human domain expert (HDE) annotator, we are building a key phrase (KP) identification model by using available CDSS text resources with minimal human feedback. This model will provide candidate phrases for HDE to review before adding to the CDSS ontology. We use deep active learning (AL) and transfer learning (TL) to train a model that identifies relevant entities, such as KP, in any text. Here, the special semi-supervised learning approach, AL, incorporates active human feedback on the least confident prediction results for diverse CDSS concepts.",
    "latest": true
  },
  "CDSS Ontology": {
    "image": "carousel_5.jpg",
    "short-description": "We are constructing a CDSS ontology aiming to improve the semantic interoperability of CDSS rules via the CDSS ontology.",
    "long-description": "Health IT has experienced rapid growth in the last several decades. Nevertheless, interoperable patient record is still not a reality. One pathway to achieve the goal is to generate: (1) portable CDSS rules, (2) interoperable immunization records for individuals, and (3) interoperable patient records eventually. We are in the effort to build a CDSS ontology to facilitate portable CDSS rules (based on CDC-recommended vaccination schedules), including the methodology and preliminary results.\nThe manual curation process includes four lines of effort: (1) brainstorm, engage in iterative discussion, and provide recommendations based on their experience; (2) conduct a manual review of the automatic method results; (3) conduct thought experiments regarding scenarios for two vaccines (MMR and HPV) in terms of the following key components: development, management, maintenance, and operation of CDSS rules; (4) conduct a manual review of and selects/adopts key concepts from the relevant ontologies, NIH common data elements, book chapters from CDSS, AHRQ CDS knowledge artifacts, HL7 CDS standards and implementation guidelines, ONC US Core Data for Interoperability (USCDI), and CDC CDS for Immunization &amp; Immunization Information Systems as well as other resources. AHRQ CDS  implementation guides and the existing CDSS taxonomy guide the thought processes.\nThe team records the detailed processes and extracts concepts that should be included in the ontology. The automatic approach focuses on using natural language processing approaches to identify relevant entities from the selected literature, from which the investigation team will decide whether or not to include and how to classify the entities.",
    "latest": true
  },
  "CDSS Modules for OpenMRS and OpenEMR": {
    "image": "carousel_3.jpg",
    "short-description": "We are developing an open and reusable CDSS module for OpenMRS and an enhanced CDSS module for OpenEMR as test beds for the interoperable CDSS rules.",
    "long-description": "CDSS modules for OpenMRS and OpenEMR will develop and share ready-to-distribute clinical decision support (CDS) module for OpenMRS [an open-source electronic medical record (EMR) system], an enhanced CDS module for OpenEMR (another open-source EMR system). They will generate educational modules on CDS and its work mechanisms. The CDS modules, which will include the Centers for Disease Control and Prevention (CDC)-recommended immunization schedules, can reach broader and existing user communities of OpenMRS and OpenEMR and potentially change clinical care delivered via these systems and enhance patient populations served by these systems. The educational modules will help better train the future healthcare information technology workforce, especially on CDS.",
    "latest": true
  },
  "User Testing": {
    "image": "carousel_4.jpg",
    "short-description": "We will invite primary care providers (i.e., general practitioners or family medicine physicians nurses) to participate in a usability and utility test for the CDSS modules in OpenMRS and OpenEMR.",
    "long-description": "We will invite primary care providers (i.e., general practitioners or family medicine physicians nurses) to participate in a usability and utility test for the CDSS modules in OpenMRS and OpenEMR."
  },
  "CDSS Open Course": {
  "image": "carousel_2.jpg",
  "short-description": "This open course focuses on CDSS design, development, use, maintenance, and evaluation. For Clemson and MUSC BDSI (https://www.cs.clemson.edu/bdsi/) students, this course will be offered as 3 credit hours in the near future.",
  "long-description": "CDSS Open Course is the educational component of the CDSS4PCP project. It includes CDSS teaching modules that can be used among students and trainees interested in the CDSS and its working mechanisms. The educational modules will consist of lectures and hands-on sessions in a 1:1 ratio. The main discussion points will be provided for lectures and hands-on sessions, which include detailed instructions.\n\nThese educational modules can be used by non-computer science (CS) majors/background users who might have a background in nursing, health, or medicine to understand the working mechanisms of CDSS, rule maintenance, configuration, back end, and integration mechanisms between CDSS and EMR. Such technical details are critical for these potential CDSS users and future CDSS designers to understand and, more importantly, optimize the tool to its full potential. For CS major/background students, the modules can introduce the CDSS medical terms within the clinical environment and EMR contexts, which is equally critical for CS students who want to pursue a career in healthcare IT.\n\nThe lecture slides, hands-on session instructions, discussion points, and assignment instructions will be shared freely with anyone interested in the topic; non-self-directed quizzes and grading details will be shared with instructors on a case-by-case basis per request.\n\nPlease cite the following citations to acknowledge the group:\n\nMin H, Jing X, Gong Y, Yu P. Perspectives on Enhancing Clinical Informatics Education in the Artificial Intelligence Era. Journal of Clinical Informatics. JCI 2024, 1(1), 4496. PMID: 40051784; PMCID: PMC11884742. https://doi.org/10.36922/jci.4496\n\nGong Y, Min H, Jing X, Yu P. Challenges and Opportunities of Artificial Intelligence in CDSS and Patient Safety. Stud Health Technol Inform. 2024 Aug 22;316:1250-1254. PMID: 39176608; PMCID: PMC12145886; DOI: 10.3233/SHTI240638\n\nJing X. CDSS Open Course. 2025. https://cdss4pcp.com/#/project/CDSS%2520Open%2520Course",
  "files": [
    {
      "name": "CDSS Assignment Instructions",
      "file": "https://drive.google.com/file/d/1huFX8XwZQa8aBaVstAcrcFDmbWi3cr_v/view?usp=drive_link"
    },
    {
      "name": "CDSS Syllabus",
      "file": "https://drive.google.com/file/d/14HCO_Dx187Fz9ah6nFUZvBsisgVLkv4_/view?usp=drive_link"
    },
    {
      "name": "Introduction to CDSS",
      "file": "https://drive.google.com/file/d/1tIAFxZMkdO9hTtURwZINBM4fEsDGVF4O/view?usp=drive_link"
    }
  ],
  "latest": true
}

  }
